In [18]:
import pandas as pd

## Series

In [19]:
data = [1,2,3,4,5]

In [20]:
s = pd.Series(data)

In [21]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
s.to_frame()

   0
0  1
1  2
2  3
3  4
4  5

In [22]:
index = ['Linhas' + str(i) for i in range (5)]

In [23]:
index

['Linhas0', 'Linhas1', 'Linhas2', 'Linhas3', 'Linhas4']

In [24]:
s  = pd.Series(data,index)

In [25]:
s

Linhas0    1
Linhas1    2
Linhas2    3
Linhas3    4
Linhas4    5
dtype: int64

In [30]:
data = {'Linha' + str(i) : i + 1 for i in range(5) }
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [31]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [32]:
s1 = s + 2

In [33]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [34]:
s2 = s+s1

In [35]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

In [36]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [37]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [38]:
df1 = pd.DataFrame(data = data)

In [39]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [43]:
indexlin = ['Linha' + str(i) for i in range(3)]

In [44]:
indexlin

['Linha0', 'Linha1', 'Linha2']

In [46]:
df1 = pd.DataFrame(data = data, index = indexlin)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [49]:
indexcol = ['Coluna' + str(i) for i in range(3)] 
indexcol

['Coluna0', 'Coluna1', 'Coluna2']

In [50]:
df1 = pd.DataFrame(data = data, index = indexlin, columns=indexcol)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [52]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [54]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [55]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [57]:
df3 = pd.DataFrame(data = data, index = indexlin, columns=indexcol)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [58]:
df1[df1>0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [59]:
df2[df2>0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [60]:
df3[df3>0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [61]:
df4 = pd.concat([df1,df2,df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [62]:
df4 = pd.concat([df1,df2,df3], axis=1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

In [64]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [65]:
pd.concat([df1, df2], axis = 1)

   A  B  C  D
X  1  2  3  4

In [69]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [66]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4